bjsbt-01/src/main/java/com/bitguiders/bjsbt_01/soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getUserRequest>
         <gs:userId>2</gs:userId>
      </gs:getUserRequest>
   </soapenv:Body>
</soapenv:Envelope>